import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["actionid","actionname","actionguid","soundId","posses","iconguid","price","loopPlay","PlayTime","activity","abrupt","type"],["tag","","tag","tag","tag","tag","tag","tag","tag","tag","tag",""],[40001,"打招呼","8352",0,true,"146441",0,1,670,1,0,1],[40002,"行礼","15057",0,true,"146740",0,1,3430,0,0,1],[40003,"点赞","95777",0,true,"146737",0,1,1930,0,0,1],[40004,"比心","15078",0,true,"146445",0,1,1330,0,0,1],[40005,"摇头","95775",0,true,"146502",0,1,1470,0,0,1],[40006,"后空翻","14602",0,true,"146460",0,1,1500,1,1,1],[40007,"打CALL","122288",0,true,"146696",0,1,600,0,0,1],[40008,"生气","14766",0,true,"146581",0,1,2000,1,0,1],[40009,"哭泣","14655",13,true,"146742",0,1,630,0,0,1],[40010,"劲舞","88450",0,true,"146411",0,0,8700,1,0,2],[40011,"海盗舞","124621",0,true,"146701",0,0,7400,1,0,2],[40012,"慢摇","123636",0,true,"146700",0,0,1570,1,0,2],[40013,"电子舞","122750",0,true,"146465",0,0,8000,1,0,2],[40014,"旋转","14552",0,true,"146537",0,0,530,1,0,1],[40015,"扭腰","121811",0,true,"146622",0,0,1070,1,0,1],[40016,"炫舞","88544",0,true,"146693",0,0,6520,1,0,2],[40017,"舞蹈","88448",0,true,"146673",0,0,7770,1,0,2],[40018,"嘻哈舞","122676",0,true,"146515",0,0,6500,1,0,2],[40019,"跳跃舞姿","122745",0,true,"146468",0,0,4270,1,0,2],[40020,"街舞","122813",0,true,"146603",0,0,2330,1,0,2],[40021,"霹雳舞","124498",0,true,"146662",0,0,10670,1,0,2],[40022,"太空步","124500",0,true,"146463",0,0,4670,1,0,2]];
export interface IActionElement extends IElementBase{
 	/**动作ID*/
	actionid:number
	/**动作名称*/
	actionname:string
	/**GUID*/
	actionguid:string
	/**对应音效表id*/
	soundId:number
	/**初始是否拥有*/
	posses:boolean
	/**动作图标GUID*/
	iconguid:string
	/**价格*/
	price:number
	/**是否循环播放*/
	loopPlay:number
	/**播放时间*/
	PlayTime:number
	/**是否可以移动打断(0不允许：1允许）*/
	activity:number
	/**打断时间（单位ms，开始交互后开始计时，如果是打断态：该时间前维持前一列的状态，该时间后统一变为可移动可跳跃）*/
	abrupt:number
	/**类型1动作2舞蹈*/
	type:number
 } 
export class ActionConfig extends ConfigBase<IActionElement>{
	constructor(){
		super(EXCELDATA);
	}

}