import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","Role","Del"],["","",""],[1,"142904","万磁王"],[2,"141618","赛博自来也"],[3,"142889","海王"],[4,"142895","洛基"],[5,"142887","恶灵骑士"],[6,"142898","美国队长"],[7,"142886","毒液"],[8,"142899","灭霸拳套"],[9,"142925","鸣人"],[10,"142917","干柿鬼鲛"],[11,"143229","宇智波斑"],[12,"142272","机甲少女"],[13,"142903","死侍"],[14,"142900","奇异博士"],[15,"142879","兔女郎"],[16,"142888","钢铁侠"],[17,"142894","雷神"],[18,"142907","蜘蛛侠"],[19,"142892","金刚狼"],[20,"142885","超人"],[21,"142893","惊奇队长"],[22,"142193","刺客男"],[23,"142194","刺客女"],[24,"142913","雏田"],[25,"142922","路飞"],[26,"143236","佐助"]];
export interface INPCElement extends IElementBase{
 	/**id*/
	id:number
	/**角色*/
	Role:string
	/**注释*/
	Del:string
 } 
export class NPCConfig extends ConfigBase<INPCElement>{
	constructor(){
		super(EXCELDATA);
	}

}